## MERGE

In [4]:
import pandas as pd
df1=pd.DataFrame({
    "city":["dewas","indore","ujjain"]
,   "temp":[23,76,21]
})
df1

     city  temp
0   dewas    23
1  indore    76
2  ujjain    21

In [8]:
import pandas as pd
df2=pd.DataFrame({
    "city":["dewas","indore","bhopal"]
,   "humidity":[1,2,3]
})
df2

     city  humidity
0   dewas         1
1  indore         2
2  bhopal         3

In [ ]:
con_df=pd.merge(df1,df2,on="city")
con_df
# returns only common cities

     city  temp  humidity
0   dewas    23         1
1  indore    76         2

In [ ]:
con_df=pd.merge(df1,df2,how="outer")
con_df
# returns all data with common also

     city  temp  humidity
0  bhopal   NaN       3.0
1   dewas  23.0       1.0
2  indore  76.0       2.0
3  ujjain  21.0       NaN

In [12]:
con_df=pd.merge(df1,df2,how="left")
con_df
# returns all left side data with common data

     city  temp  humidity
0   dewas    23       1.0
1  indore    76       2.0
2  ujjain    21       NaN

In [ ]:
con_df=pd.merge(df1,df2,how="right")
con_df
# returns all right side data with common data

     city  temp  humidity
0   dewas  23.0         1
1  indore  76.0         2
2  bhopal   NaN         3